docs/comp-sci/cas.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Computer Algebra Systems</title>
<meta name="author" content="Alex Nelson" />
<meta name="generator" content="Org Mode" />
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\DeclareMathOperator{\tr}{tr}
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
% For +---- metric
\newcommand{\BDpos}{}
\newcommand{\BDneg}{-}
\newcommand{\BDposs}{\phantom{-}}
\newcommand{\BDnegg}{-}
\newcommand{\BDplus}{+}
\newcommand{\BDminus}{-}
% For -+++ metric
\newcommand{\BDpos}{-}
\newcommand{\BDposs}{-}
\newcommand{\BDneg}{}
\newcommand{\BDnegg}{\phantom{-}}
\newcommand{\BDplus}{-}
\newcommand{\BDminus}{+}
\)</div>
<link rel="stylesheet" type="text/css" href="../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Computer Algebra Systems</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#h-efc65a7b-c4a7-4274-83ea-4880d6649823">1. Introduction</a></li>
<li><a href="#h-8f4d51ab-066b-42e4-a4b0-95ed9c1ede40">2. References</a>
<ul>
<li><a href="#h-367c3493-2ebc-455e-bf4f-8593144655b1">2.1. Books</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-h-efc65a7b-c4a7-4274-83ea-4880d6649823" class="outline-2">
<h2 id="h-efc65a7b-c4a7-4274-83ea-4880d6649823"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-h-efc65a7b-c4a7-4274-83ea-4880d6649823">
<p>
A "computer algebra system" refers to a computer program capable of
symbolically computing integrals, derivatives, etc. These seem to be a
large collection of rewriting rules.
</p>

<p>
I'm curious about hacking Lisp to turn it into a CAS, similar to how
Kiat Shi Tan and friends hacked C++ and turned it into a CAS. The
consensus among the Common Lisp community seems to be, "Just use Maxima, lol."
Maxima is amazing, but I just want to hack Common Lisp to do some basic
symbolic computation.
</p>
</div>
</div>
<div id="outline-container-h-8f4d51ab-066b-42e4-a4b0-95ed9c1ede40" class="outline-2">
<h2 id="h-8f4d51ab-066b-42e4-a4b0-95ed9c1ede40"><span class="section-number-2">2.</span> References</h2>
<div class="outline-text-2" id="text-h-8f4d51ab-066b-42e4-a4b0-95ed9c1ede40">
<ul class="org-ul">
<li><a href="https://fredrikj.net/blog/">Fredrik Johansson's blog</a>, interesting symbolic computation blog</li>
<li>Thomas Fischbacher,<br>
"A novel approach to symbolic algebra".<br>
<a href="https://arxiv.org/abs/cs/0406002">arXiv:cs/0406002</a>, 15 pages, discusses an approach using MzScheme.</li>
<li>Mathematica's <a href="https://reference.wolfram.com/language/tutorial/SomeNotesOnInternalImplementation.html">Some Notes on Internal Implementation</a></li>
<li><a href="https://github.com/livelisp/livewlisp/blob/main/maxima-tutorial.txt">A way to use MAXIMA lispy</a></li>
</ul>
</div>
<div id="outline-container-h-367c3493-2ebc-455e-bf4f-8593144655b1" class="outline-3">
<h3 id="h-367c3493-2ebc-455e-bf4f-8593144655b1"><span class="section-number-3">2.1.</span> Books</h3>
<div class="outline-text-3" id="text-h-367c3493-2ebc-455e-bf4f-8593144655b1">
<ul class="org-ul">
<li>Joel Cohen,<br>
<cite class="book-title">Computer Algebra and Symbolic Computation</cite>.<br>
2 volumes; CRC Press, 2002.</li>
<li>K.O. Geddes, S.R. Czapor, G. Labahn,<br>
<cite class="book-title">Algorithms for Computer Algebra</cite>.<br>
Springer, 1992</li>
<li>Manuel Bronstein,<br>
<cite class="book-title">Symbolic Integration 1: Transcendental Functions</cite>.<br>
2nd ed., Springer-Verlag, 1997.</li>
<li>Kiat Shi Tan and Willi-Hans Steeb and Yorick Hardy,<br>
<cite class="book-title">SymbolicC++: An Introduction to Computer Algebra Using Object-Oriented Programming</cite>.<br>
2nd ed., Springer, 2000.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated: Sat, 30 Apr 2022 10:01:45 -0700
</div>
</body>
</html>
